<script lang="ts">
	import Meta from "$lib/meta.svelte";
	import Footer from "$lib/components/footer.svelte";
</script>

<Meta
	title="利用規約"
	description={["Distopiaの利用規約です。", "サービス利用時に一度ご確認ください。"].join("")}
/>

<main>
	<div class="contents">
		<div class="context">
			<h1>利用規約</h1>
			<p>下記が当サイトの利用規約になります。</p>
			<p>本規約に同意できない場合は速やかなブラウザバックを推奨します。</p>

			<h1>第1条 禁止事項</h1>
			<h3>ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。</h3>
			<p>1 法令または公序良俗に違反する行為</p>
			<p>2 犯罪行為に関連する行為</p>
			<p>3 本サービスの内容等，本サービスに含まれる著作権，商標権ほか知的財産権を侵害する行為</p>
			<p>
				4
				本サイト，ほかのユーザー，またはその他第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為
			</p>
			<p>5 本サービスによって得られた情報を商業的に利用する行為</p>
			<p>6 本サイトのサービスの運営を妨害するおそれのある行為</p>
			<p>7 不正アクセスをし，またはこれを試みる行為</p>
			<p>8 不正な目的を持って本サービスを利用する行為</p>
			<p>9 本サービスの他のユーザーまたはその他の第三者に不利益，損害，不快感を与える行為</p>
			<p>10 本サイトが許諾しない本サービス上での宣伝，広告，勧誘，または営業行為</p>
			<p>11 本サイトのサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為</p>
			<p>12 その他，本サイトが不適切と判断する行為</p>

			<h1>第2条 保証の否認および免責事項</h1>
			<p>
				本サイトは，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
			</p>
			<p>
				本サイトは，本サービスに起因してユーザーに生じたあらゆる損害について、本サイトの故意又は重過失による場合を除き、一切の責任を負いません。ただし，本サービスに関する本サイトとユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。
			</p>
			<p>
				本サイトは，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
			</p>

			<h1>第3条 サービス内容の変更等</h1>
			<p>
				本サイトは，ユーザーへの事前の告知をもって、本サービスの内容を変更、追加または廃止することがあり、ユーザーはこれを承諾するものとします。
			</p>

			<h1>第4条 個人情報の取扱い</h1>
			<p>
				本サイトは，本サービスの利用によって取得する個人情報については，本サイト「プライバシーポリシー」に従い適切に取り扱うものとします。
			</p>

			<h1>第5条 通知または連絡</h1>
			<p>
				ユーザーと本サイトとの間の通知または連絡は，本サイトの定める方法によって行うものとします。本サイトは,ユーザーから,本サイトが別途定める方式に従った変更届け出がない限り,現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い,これらは,発信時にユーザーへ到達したものとみなします。
			</p>

			<h1>第6条 権利義務の譲渡の禁止</h1>
			<p>
				ユーザーは，本サイトの書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。
			</p>

			<h1>第7条 準拠法・裁判管轄</h1>
			<p>本規約の解釈にあたっては，日本法を準拠法とします。</p>
			<p>
				本サービスに関して紛争が生じた場合には，当社の本店所在地を管轄する裁判所を専属的合意管轄とします。
			</p>
		</div>
	</div>
</main>
<Footer />

<style>
	main {
		min-height: 90vh;
	}
	p,
	h1,
	h3 {
		color: white;
	}
	.context {
		overflow: hidden;
		margin: 10px 20px;
	}
	.contents {
		overflow: hidden;
		display: block;
		background-color: rgb(37, 36, 41);
		border-radius: 10px;
		width: 90%;
		margin: 20px auto;
	}
</style>
